{
  "Lesson": 5,
  "LessonElements": [
    {
      "LessonText": "Testiranje korisničkog iskustva u fazi pretprodukcije videoigara može biti provedeno na različite načine, kao što su upitnici, provođenje intervjua ili metoda fokus grupa."
    },
    {
      "LessonText": "Metoda fokus grupa je metoda testiranja usmjerena krajnjim korisnicima. Fokus grupa (engl. focus group) je skupina ljudi (obično 5-10 osoba) okupljena kako bi sudjelovala u raspravi o proizvodu (npr. o igri) u fazi pretprodukcije. Fokus grupe se uglavnom provode tijekom faze razvoja koncepta videoigre, kako bi dizajnerima pomogle da što ranije odrede ključne elemente vezane uz koncept igre, kao što su umjetnički stil, narativ, mehanike i dizajn sučelja."
    },
    {
      "LessonText": "U fokus grupi sudjeluju:"
    },
    {
      "LessonText": "   - odabrani sudionici: odabrane osobe iz ciljane populacije (npr. igrači kojima je igra namijenjena),"
    },
    {
      "LessonText": "   - moderator: istraživač koji usmjerava raspravu i postavlja pitanja,"
    },
    {
      "LessonText": "   - zapisničar: osoba koja piše bilješke."
    },
    {
      "LessonText": "Prije početka rasprave, moderator priprema specifične teme o kojima bi grupa trebala diskutirati te raspored koji određuje vremensku posvećenost svakoj temi. Riječ je samo o okvirnom rasporedu jer je dinamika grupne rasprave nepredvidiva – može doći do otvaranja novih tema ili duljoj posvećenosti nekoj temi. Prirodni tijek rasprave može dovesti do rasprave o ciljanim temama drugačijim redoslijedom od predviđenog. Ponekad i sami sudionici preuzmu dio inicijative u vođenju diskusije. Uloga je moderatora da pokuša taktično odvratiti raspravu od tema koje nisu u fokusu rasprave."
    },
    {
      "LessonText": "Fokus grupe općenito ne traju dulje od 90 minuta kako ne bi postale previše zamorne za sudionike. Bitno je grupnu raspravu održati u ugodnoj prostoriji i osigurati vizualne materijale koji će se koristiti u raspravi. Materijali se mogu pokazati sudionicima i prije provedbe fokus grupe, kako bi ih mogli na miru i samostalno proučiti. Ako im se materijali prikazuju na početku ili tijekom grupne rasprave, poželjno je dopustiti kratko vrijeme da svatko individualno prouči materijale radi stvaranja vlastitog mišljenja prije grupne rasprave."
    },
    {
      "LessonText": "Na temelju transkripta snimke rasprave ili bilješki zapisničara provodi se daljnja analiza rasprave. Primarno se radi o prikupljanju kvalitativnih podataka koji se obično analiziraju tematski. Označavanjem dijelova transkripta ključnim riječima koje označavaju teme rasprave može se pratiti što je sve rečeno vezano uz određenu temu te koliko je često nešto rečeno, što pomaže kod organizacije podataka i određivanja zaključaka. Dijelovi rasprave se time mogu označiti prema preferencijama sudionika te predloženim idejama za poboljšanje. Izvještaj nakon održane fokus grupe obično je pisani dokument koji na strukturirani način prikazuje ključne zaključke vezane uz postavljena pitanja ili teme rasprave."
    }
  ]
}